<a href="https://colab.research.google.com/github/Uchihha/RahulKhajuria_22-27-10/blob/main/DATA_FRAME_CODES_PANDAS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>



*   Rahul khajuria

*   22-27-10

*   Mtech Data Science

In [3]:
import numpy as np
import pandas as pd
df=pd.read_csv('/content/drive/MyDrive/data/housingdata.csv')
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN
8  100009000.0           HP      21212           na        2  1800

In [4]:
# Displaying first 6 rows
df.head(6)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800

In [6]:
#Displaying column names
df.columns.tolist()

['PID', 'STATE', 'PRICE', 'NUM_BEDROOMS', 'NUM_BATH', 'SQ_FT']

In [10]:
#Displaying column names
df.columns.tolist()

['PID', 'STATE', 'PRICE', 'NUM_BEDROOMS', 'NUM_BATH', 'SQ_FT']

In [11]:
#Displaying column names
df.index.tolist()

[0, 1, 2, 3, 4, 5, 6, 7, 8]

In [13]:
import numpy as np
list1=pd.unique(df.STATE)
print(list1)
print(len(list1))

['MP' 'MAHARASHTRA' 'AP' 'TN' 'ASSAM' 'HP']
6

In [15]:
#List of all NaN
df.isna

<bound method DataFrame.isna of            PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN
8  100009000.0           HP      21212           na        2  1800>

In [4]:
# convert it into a boolean list

nan_cells = df.isnull()

nan_cells_list = nan_cells.values.tolist()
print(nan_cells_list)

[[False, False, False, False, False, False], [False, False, False, False, False, False], [False, False, False, True, False, False], [False, False, False, False, True, False], [True, False, False, False, False, False], [False, False, False, True, False, False], [False, False, False, False, False, False], [False, False, False, False, False, True], [False, False, False, False, False, False]]

In [19]:

#Drop all rows with values is Num_Bedroom
d=df.dropna(subset=['NUM_BEDROOMS'])
d=df[(df.NUM_BEDROOMS != 'na')]
print(d)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN

In [21]:
#Replace the NaN and string entries in 'NUM_BATH' with previous entries.
df['NUM_BATH']=df.NUM_BATH.fillna(method='ffill')
df['NUM_BATH']=df.NUM_BATH.replace('HURLEY',2)
print(df)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
3  100004000.0           TN     321321            1      1.5   700
4          NaN           TN  589465645            3        2  1600
6  100007000.0        ASSAM    3222321            2        2   950
7  100008000.0           HP      23131            1        1   NaN

In [26]:
# Replace the empty values in 'SQ_FT' with the mean of all entries
df['SQ_FT']=df.SQ_FT.replace('--',np.NaN)
df['SQ_FT']=df.SQ_FT.astype(float)
df['SQ_FT']=df.SQ_FT.replace(np.NaN,df.SQ_FT.mean())
print(df)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0           MP     321654            3        1  1000.0
1  100002000.0  MAHARASHTRA      21325            3      1.5  1062.5
3  100004000.0           TN     321321            1      1.5   700.0
4          NaN           TN  589465645            3        2  1600.0
6  100007000.0        ASSAM    3222321            2        2   950.0
7  100008000.0           HP      23131            1        1  1062.5

In [27]:
# Sum of SQ_FT of all entries in the dataset
sum=df.SQ_FT.sum()
print(sum)

6375.0

In [2]:
# Add a new column "NUM_STORE" and with all the values as 1 for all rows
df['NUM_STORE']=1
df

NameError: ignored

In [ ]:
# Create a DataFrame ontainning all entries of TN state only
df1=pd.DataFrame(df[df['STATE']=='TN'])
print(df1)

In [ ]:
# Create a DataFrame having SQ_FT area greater than 1000 and display the DataFrame
df2=pd.DataFrame(data[data['SQ_FT']>1000])
print(df2)

**END**
---

In [ ]:
#number of unique states in data set
g=df.groupby('STATE')
g

In [ ]:
for STATE in g:
  print( [STATE ])

[('AP',            PID STATE    PRICE NUM_BEDROOMS NUM_BATH SQ_FT
2  100003000.0    AP  2541654          NaN        1   850)]
[('ASSAM',            PID  STATE    PRICE NUM_BEDROOMS NUM_BATH SQ_FT
6  100007000.0  ASSAM  3222321            2   HURLEY   950)]
[('HP',            PID STATE  PRICE NUM_BEDROOMS NUM_BATH SQ_FT
7  100008000.0    HP  23131            1        1   NaN
8  100009000.0    HP  21212           na        2  1800)]
[('MAHARASHTRA',            PID        STATE  PRICE NUM_BEDROOMS NUM_BATH SQ_FT
1  100002000.0  MAHARASHTRA  21325            3      1.5    --)]
[('MP',            PID STATE   PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0    MP  321654            3        1  1000)]
[('TN',            PID STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
3  100004000.0    TN     321321            1      NaN   700
4          NaN    TN  589465645            3        2  1600
5  100006000.0    TN   65465466          NaN        1   800)]

In [ ]:
g.get_group('TN')

           PID STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
3  100004000.0    TN     321321            1      NaN   700
4          NaN    TN  589465645            3        2  1600
5  100006000.0    TN   65465466          NaN        1   800

In [ ]:
g.max()

<ipython-input-22-66de9d4165b9>:1: FutureWarning: Dropping invalid columns in DataFrameGroupBy.max is deprecated. In a future version, a TypeError will be raised. Before calling .max, select only columns which should be valid for the function.
  g.max()

                     PID      PRICE
STATE
AP           100003000.0    2541654
ASSAM        100007000.0    3222321
HP           100009000.0      23131
MAHARASHTRA  100002000.0      21325
MP           100001000.0     321654
TN           100006000.0  589465645

In [ ]:
df.to_csv('housingdata.csv')

In [ ]:
df['PRICE'].max()

589465645

In [ ]:
df['PRICE'].mean()

73489303.22222222

In [ ]:
df.shape

(9, 6)

In [ ]:
df[['PRICE','NUM_BEDROOMS']]

       PRICE NUM_BEDROOMS
0     321654            3
1      21325            3
2    2541654          NaN
3     321321            1
4  589465645            3
5   65465466          NaN
6    3222321            2
7      23131            1
8      21212           na

In [ ]:
df[:5]

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1   NaN
1  100002000.0  MAHARASHTRA      21325            3      1.5   NaN
2  100003000.0           AP    2541654          NaN        1   NaN
3  100004000.0           TN     321321            1      NaN   NaN
4          NaN           TN  589465645            3        2   NaN

In [ ]:

e=df['PRICE'].describe()
e

count    9.000000e+00
mean     7.348930e+07
std      1.946684e+08
min      2.121200e+04
25%      2.313100e+04
50%      3.216540e+05
75%      3.222321e+06
max      5.894656e+08
Name: PRICE, dtype: float64

In [ ]:
df[df.PRICE==df.PRICE.min()]

           PID STATE  PRICE NUM_BEDROOMS NUM_BATH SQ_FT
8  100009000.0    HP  21212           na        2  1800

In [ ]:
df.STATE[df.PRICE==df.PRICE.max()]

4    TN
Name: STATE, dtype: object